0.1.0/tutorials/incompressible/piso/les/pitz_daily_mapped/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type                mapped;
    value               uniform 2e-05;
    interpolationScheme cell;
    setAverage          false;
    average             2e-05;
  }
  outlet
  {
    type                inletOutlet;
    inletValue          uniform 0;
    value               uniform 0;
  }
  upperWall
  {
    type                fixedValue;
    value               uniform 0;
  }
  lowerWall
  {
    type                fixedValue;
    value               uniform 0;
  }
  frontAndBack
  {
    type                empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
